Repository: bcedu/ValaSimpleHTTPServer
Catalog: po/*.po
Languages: it, pt_br

source: Open an http server in the selected folder and share your files.
it: Apri un server http nella cartella selezionata e condividi i tuoi file.
pt_br: Abra um servidor http em uma pasta e compartilhe seus arquivos.

source: app;vala;share;files;server;http;
it: app;vala;condividi;file;server;http;

source: Access your files from any device on the same network
it: Accedi ai tuoi file da qualsiasi dispositivo sulla stessa rete

source: VServer opens an http server in the desired folder. Very useful to share files in a easy and fast way. Do you have a film on the computer and you want to watch it on your mobile phone? Just start Vserver in you computer and go to the given link with the mobile phone, you will have the film right there!
it: VServer apre un server http nella cartella desiderata. Molto utile per condividere file in modo facile e veloce. Hai un film sul computer e tu vuoi guardarlo sul tuo cellulare? Basta avviare Vserver nel tuo computer e vai al link indicato con il cellulare, avrai il film giusto Là!

source: It has been developed to follow the same behaviour than the wellknown python's simpleHTTPserver.
it: È stato sviluppato per seguire lo stesso comportamento del noto server HTTP semplice di Python.
pt_br: É desenvolvido para seguir o mesmo comportamento do bem conhecido simpleHTTPserver do Python

source: It also works throught comand line options. Try typing 'flatpak run com.github.bcedu.valasimplehttpserver --help' to learn more.
it: Funziona anche tramite le opzioni della riga di comando. Prova a digitare 'flatpak run com.github.bcedu.valasimplehttpserver --help' per saperne di più.

source: Redesigned web navigation:
it: Navigazione web riprogettata:

source: Show directories on top, then the regular files sorted by type and alphabet
it: Mostra le directory in alto, quindi i file normali ordinati per tipo e alfabeto

source: Don't display hidden files
it: Non visualizzare i file nascosti

source: Custom icon for each file depending on it's type
it: Icona personalizzata per ogni file a seconda del tipo

source: Responsive layout
it: Layout reattivo

source: Display file size
it: Visualizza la dimensione del file

source: Display file type
it: Visualizza il tipo di file

source: Display modifications date
it: Visualizza la data delle modifiche

source: Special thanks to @amka (https://github.com/amka) for this incredible work!
it: Un ringraziamento speciale a @amka (https://github.com/amka) per questo incredibile lavoro!

source: Show QR code
it: Mostra codice QR

source: Bug fix: sometimes an IPv6 was shown instead of an IPv4
it: Bug fix: a volte veniva mostrato un IPv6 invece di un IPv4

source: Update translations
it: Aggiornate le traduzioni

source: Typo fixes in some texts
it: Correzioni di errori di battitura in alcuni testi

source: Use libsoup3.0 (developers things: change things that already work to do the same thing that is already working risking failing things that did not fail).
it: Usa libsoup3.0 (cose da sviluppatori: cambia le cose che già funzionano per fare la stessa cosa che sta già funzionando rischiando di far fallire cose che non hanno fallito).

source: Suport for large files (more than 1 GB)
it: Supporto per file di grandi dimensioni (più di 1 GB)

source: Suport for files with special characters in the name (`, $, %, etc.)
it: Supporto per file con caratteri speciali nel nome (`, $, %, ecc.)

source: Dutch translations
it: Traduzione olandese

source: VServer release
it: Versione VServer
pt_br: Lançamento do VServer

source: Make app translatable.
it: Reso l'app traducibile.
pt_br: Permitir traduções.

source: Add Catalan translations.
it: Aggiunta traduzione in Catalano.
pt_br: Adicionar traduções para o Catalão

source: Add French translations.
it: Agiunta traduzione Francese.
pt_br: Adicionar traduções para o Francês

source: Start an http server through a clean and minimalist gui.
it: Avvia un server http tramite una GUI pulita e minimalista.
pt_br: Inicie um servidor http por uma interface minimalista e limpa.

source: Use the command line options to start an http server through the console (type "com.github.bcedu.valasimplehttpserver --help" to learn more).
it: Utilizza le opzioni della riga di comando per avviare un server http tramite la console (digita "com.github.bcedu.valasimplehttpserver --help" per saperne di più).
pt_br: Use o terminal para iniciar um servidor http sem uma interface (digite "com.github.bcedu.valasimplehttpserver --help" para aprender mais).

source: Choose the port where vserver listens through the gui.
it: Scegli la porta in cui vserver è in ascolto attraverso la GUI.
pt_br: Escolha uma porta para o VServer receber conexões pela interface.

source: Initial 1.0.2 release!
it: Rilascio iniziale 1.0.2!
pt_br: Lançamento inicial 1.0.2!

source: Window width
it: Larghezza della finestra

source: Window height
it: Altezza della finestra

source: Window hortitzontal position
it: Posizione orizzontale della finestra

source: Window vertical position
it: Posizione verticale della finestra

source: The saved state of the window
it: Lo stato salvato della finestra

source: Your files are at
it: I tuoi file sono in
pt_br: Seus arquivos estão em

source: Share your files
it: Condividi i tuoi file
pt_br: Compartilhe seus arquivos

source: Select a folder and start sharing
it: Seleziona una cartella e avvia la condivisione
pt_br: Selecione uma pasta e comece a compartilhar

source: Open
it: Apri
pt_br: Abrir

source: Browse to select a folder
it: Sfoglia per selezionare una cartella
pt_br: Navegue para selecionar uma pasta

source: Cancel
it: Cancella
pt_br: Cancelar

source: Listening at port:
it: In ascolto nella porta:
pt_br: Receber conexões na porta:

source: Configuration
it: Configurazione

source: Save
it: Salva

source: Back
it: Indietro

source: Server is listening on:
pt_br: Recebendo conexões em:

source: Select packages to install
pt_br: Selecione pacotes para instalar

source: Settings
pt_br: Configurações

source: Simple File Server
pt_br: Servidor de Arquivos Simples

source: Listening on:
pt_br: Recebendo conexões em:

source: Requested: %s, full path: %s
pt_br: Pedido: %s, caminho: %s

source: %s<h1>Listing files of: %s</h1>
pt_br: %s<h1>Mostrando arquivos de: %s</h1>

source: Acces to your files from any device in the same network
pt_br: Acesse seus arquivos em qualquer dispositivo na rede

source: VServer opens an http server in the desired folder. Very usefull to share files in a easy and fast way. Do you have a film in the computer and you want to watch it on the mobile phone? Just start Vserver in you computer and go to the given link with the mobile phone, you will have the film right there!
pt_br: O VServer abre um servidor http em uma pasta. Útil para compartilhar arquivos de forma rápida e fácil. Tem algum filme no seu computador que deseja assistir no seu celular? É só iniciar o VServer no computador e usar o link dado pelo VServer e seu filme estará logo ali!

source: It also works throught comand line options. Try typing 'com.github.bcedu.valasimplehttpserver --help' to learn more.
pt_br: Também é possível usar pelo terminal, tente digitar 'com.github.bcedu.valasimplehttpserver --help' para aprender mais.
